
/*
	* 淮阴侯列传
	淮阴侯韩信者，淮阴人也。始为布衣时，不得推择为吏，又不能治生商贾，常从人寄食饮，人多厌之者，常数从其下乡南昌亭长寄食，
	数月，亭长妻患之，乃晨炊蓐食。食时信往，不为具食。信亦知其意，怒，竟绝去。

	信钓於城下，诸母漂，有一母见信饥，饭信，竟漂数十日。信喜，谓漂母曰：吾必有以重报母。母怒曰：大丈夫不能自食，吾哀王孙
	而进食，岂望报乎！

	淮阴屠中少年有侮信者，曰：若虽长大，好带刀剑，中情怯耳。众辱之曰：信能死，刺我；不能死，出我跨下。於是信孰视之，俛出
	胯下，蒲伏。一市人皆笑信，以为怯。

	及项梁渡淮，信仗剑从之，居戏下，无所知名。项梁败，又属项羽，羽以为郎中。数以策干项羽，羽不用。汉王之入蜀，信亡楚归汉，
	未得知名，为连敖。坐法当斩，其辈十三人皆已斩，次至信，信乃仰视，適见滕公，曰：上不欲就天下乎？何为斩壮士!滕公奇其言，
	壮其貌，释而不斩。与语，大说之。言於上，上拜为治粟都尉，上未之奇也。

	信数与萧何语，何奇之。至南郑，诸将行道亡者数十人，信度何等已数言上，上不我用，即亡。何闻信亡，不及以闻，自追之。人有言上曰:
	丞相何亡。上大怒，如失左右手。居一二日，何来谒上，上且怒且喜，骂何曰：若亡，何也？何曰:臣不敢亡也，臣追亡者。上曰：若所追者谁何？
	曰：韩信也。上复骂曰：诸将亡者以十数，公无所追；追信、诈也。何曰：诸将易得耳。至如信者，国士无双。王必欲长王汉中，无所事信；必
	欲争天下，非信无所与计事者。顾王策安所决耳。王曰:吾亦欲东耳，安能郁郁久居此乎？何曰：王计必欲东，能用信，信即留；不能用，信终亡耳。
	王曰：吾欲公以为将。何曰：虽为将，信必不留。王曰：以为大将。何曰：幸甚。于是王欲召信拜之。何曰：王素慢无礼，今拜大将如呼小儿耳，此乃
	信所以去也。王必欲拜之，择良日，斋戒，设祭坛，具礼，乃可耳。王许之，诸将皆喜，人人各自以为得大将。至拜大将，乃韩信也，一军皆惊。

	信拜礼毕，上坐。王曰：丞相数言将军，将军何以教寡人计策？信谢，因问王曰，今东乡争权天下，岂非项王邪？汉王曰：然。曰：大王自料
	勇悍仁强孰与项王? 汉王默然良久，曰：不如也。信再拜贺曰：惟信亦为大王不如也。然臣尝事之，请言项王之为人也。项王暗噁叱咤，千人
	皆废，然不能任属贤将，此特匹夫之勇耳。项王见人恭敬慈爱，言语呕呕，人有疾病，涕泣分食饮，至使人有功当封爵者，印
*/